
{
  "basics": {
    "name": "Monica Gosschalk",
    "label": "UX Design, Prototyping, Business Analyst",
    "picture": "",
    "email": "monicagosschalk@gmail.com",
    "phone": "",
    "website": "",
    "summary": "I am a multidisciplinary UX Designer and Developer who is constantly learning new technologies.  A conscientious and analytical Business Analyst and User Experience Designer with strong creative and problem solving skills with commercial experience in product and software development in the Education, Healthcare, Publishing and Advertising sectors.  Versatile, having experience of the full product lifecycle from:- requirements analysis, persona use cases, wireframe product design storyboards, UML process design, functional specification and user testing.  Works closely with stakeholders to understand user needs and business requirements in order to deliver business value.  Experience of using wireframe story boards and UML process flows and entity relationship diagrams to define requirements.",
    "highlights": [
      "Gained an intermediate understanding of Ruby on Rails as a result of having created a pinterest style web application, an online payment web app using Stripe for payment processing and a movie review web app as a result of having completed a basic and advanced Ruby on Rails course at Pragmatic Studio.  ",
      "Defined the business, functional requirements and wireframes for the first generation publishing and subscription e-commerce solution for Lloyds List at Informa Plc. Conducted workshops with Publishers and senior managers to elicit requirements and manage stakeholder expectations.  Worked closely with in-house and outsourced developers in order to build a custom built solution. ",
      "Defined process flows and functional requirements for an in-house CRM, marketing email solution for Circle EURO RSCG.  Worked with marketing strategists to define decision points along the user journey from registration, making a purchase and generating process flows to encourage customer retention.",
      "Worked on User Interface and Front end design for BUPA to create a website for BUPA’s medical consultants for online billing and enable them to exchange ideas in a forum.  ",
      "Awarded a Teacher Training Scholarship from the British Computer Society.  Created and Designed Lessons and Tutorials for teaching Computer Science using materials designed using Bloom’s Taxonomy of learning objectives to differentiate for different abilities."
    ],
    "location": {
      "address": "",
      "postalCode": "",
      "city": "London",
      "countryCode": "",
      "region": "UK",
      "quotes": [
        { "author": "Ron Dennis, 2000, McLaren Mercedes GP",
          "text": "Don't be satisfied with yesterday.  Choose the right equipment, use it the right way. Refuse to compromise, because you can.  Expect to succeed, then start again."
        },
        { "author": "Steve Ballmer",
          "text": "The number one benefit of information technology is that it empowers people to do what they want to do.  It lets people be productive.  It lets people learn things they didn't think they could learn before, and so in a sense it is all about potential."
        },
        {
          "author": "Sydney J. Harris",
          "text": "The real danger is not that computers will begin to think like men, but that men will begin to think like computers."
        }
      ]
    },
    "profiles": [{
      "network": "",
      "username": "",
      "url": ""
    }]
  },
  "projects": [
    {
      "name": "",
      "id": 1,
      "summary": "",
      "description": "",
      "course": "Angular Styling & Animations (for Angular 2 and Angular 4)",
      "courseAuthor": "Maximilian Scharzmuller",
      "courseUrl": "https://www.udemy.com/angular-styling-animations-for-angular-2-and-angular-4/",
      "image": "",
      "url": ""
    },
    {
      "name": "",
      "id": 2,
      "summary": "",
      "description": "",
      "course": "Angular 4 (formerly Angular 2) - The Complete Guide",
      "courseAuthor": "Maximilian Scharzmuller",
      "courseUrl": "https://www.udemy.com/the-complete-guide-to-angular-2/",
      "image": "",
      "url": ""
    },
    {
      "name": "",
      "id": 3,
      "summary": "",
      "description": "",
      "course": "Angular 2 + Rails 5 Bootcamp",
      "courseAuthor": "Jordan Hudgens",
      "courseUrl": "https://www.udemy.com/angular-on-rails-course/",
      "image": "",
      "url": ""
    },
    {
      "name": "",
      "id": 4,
      "summary": "",
      "description": "",
      "course": "Angular 2 From The Ground Up",
      "courseAuthor": "Mirko Nasato",
      "courseUrl": "https://www.udemy.com/angular-2-from-the-ground-up/",
      "image": "",
      "url": ""
    },
    {
      "name": "",
      "id": 5,
      "summary": "",
      "description": "",
      "course": "Learn Angular 2 Development By Building 12 Apps",
      "courseAuthor": "Eduonix Learning Solutions",
      "courseUrl": "https://www.udemy.com/learn-angular-2-development-by-building-10-apps/",
      "image": "",
      "url": ""
    },
    {
      "name": "",
      "id": 6,
      "summary": "",
      "description": "",
      "course": "Build Enterprise Applications with Angular 2 (and Angular 4)",
      "courseAuthor": "Mosh Hamedani",
      "courseUrl": "https://www.udemy.com/angular2-advanced/",
      "image": "",
      "url": ""
    }
  ],
  "work": [
    {
    "company": "Computer Science Teaching",
    "position": "Computer Science Teacher",
    "website": "",
    "startDate": "September 2013",
    "endDate": "July 2016",
    "summary": "Supply Teaching: Taught in both independent and mainstream secondary schools teaching the Computer Science curriculum to students in years 7 to 13.",
    "link": "computing",
    "highlights": [
      "Introduced Python to all Year 9 students in an independent school who had no experience in text based programming",
      "Taught JavaScript to Year 10 in a mainstream school taking the OCR GCSE Computing exam in preparation of the Practical Investigation Controlled Assessment",
      "Taught AQA AS level classes for Computer Science theory and encouraged students to work in an analytical way and to share solutions to problems."
    ]
  },
  {
    "company": "Microsoft Kodu Course Creation",
    "position": "Course creator and Trainer",
    "website": "",
    "startDate": "Stptember 2011",
    "endDate": "July 2013",
    "summary": "Created a course using Microsoft Kodu to teach conditional logic and visual programming to primary school children.",
    "link": "kodu",
    "highlights": [
      "Developed and presented an after school club for children to learn game development and conditional logic using Kodu Game Lab.",
      "Wrote modular course material suitable for group work and for self-study for the children to quickly acquire the skills and confidence to develop their own games. ",
      "Two groups of children reached Kodu Kup Microsoft finals as a result of taking part in the training course."
    ]
  },
  {
    "company": "Primary carer",
    "position": "",
    "website": "",
    "startDate": "2002",
    "endDate": "2011",
    "summary": "Developed a course for improving early literacy and descriptive writing.",
    "link": "carer",
    "highlights": [
      "Primary carer for my son during his early primary school years.  Focused on improving speech, reading, literacy and maths in line with Key Stage 1 and 2 primary school curriculum.",
      "Researched methods for improving literacy and writing for primary school children."
    ]
  },
  {
    "company": "EURO RSCG Circle",
    "position": "CRM Business Analyst and UX designer",
    "website": "",
    "startDate": "January 2000",
    "endDate": "October 2002",
    "summary": "Wrote business, functional and technical requirements.  Originated process diagrams illustrating decision points throughout the customer journey. ",
    "link": "eurorscg",
    "highlights": [
      "Worked with marketing planners and designed a customer relationship marketing software solution which maps customer journeys through a buyer's lifecycle.  ",
      "Customer states are tagged across the acquisition, retention and cross selling stages of the customer journey.",
      "Potential buyers are sent marketing communication relevant to their tagged state within the customer journey.",
      "Defined the business process requirements which map a customer's explicit behaviour from online forms and their event based activities which log specific web pages the customer has visited.  ",
      ".  Liaised with Developers in the US and prepared an iterative development plan to build a modular software solution using existing and new software.  ",
      "Wrote proposals for pre-sales client pitches for content management and customer relationship marketing solutions."
    ]
  },
  {
    "company": "Informa Plc",
    "position": "Business Analyst",
    "website": "",
    "startDate": "1999",
    "endDate": "2000",
    "summary": "Business requirements and technical requirements.  Product evaluations to evaluate content management software.  Modified xml DTDs for publishing entity relationship diagrams for a content management database.",
    "link": "informa",
    "highlights": [
      "Liaised with business directors and managers in charge of trade publications in order to articulate and write an e-business strategy and requirements for delivering an ecommerce publishing solution. ",
      "Developed the first version of the interactive e-commerce publishing portal (www.lloydslist.com).  The interactive service enabled different types of users to access information relevant to their professional purposes and requirements.  ",
      "The interactive service combined information from databases about ship ownership, cargo, and destination as well as up to date news stories about the maritime industry. ",
      " Worked with editors and journalists to ensure that during the pre-production phase each ship mentioned in a news story was cross-referenced with the relevant ship's record in the database.  Wrote a business case to the Board and recommended and delivered  a content management and e-commerce solution."
    ]
  },
  {
    "company": "IT Network",
    "position": "Business Analyst",
    "website": "",
    "startDate": "1998",
    "endDate": "1999",
    "summary": "Gap analysis between existing software and business requirements.  Technical requirements and wireframe storyboards.",
    "link": "itnetwork",
    "highlights": [
      "Developed an interactive service to provide users with detailed information about computer hardware and peripherals combined with news stories and videos.   ",
      "The purpose of the site was to provide marketing information about products to potential customers.   ",
      "Revenue was earned from the site by selling advertising space to frequently accessed web pages with relevant content.  ",
      "Conducted workshops with business stakeholders in order to discuss and prioritise detailed business requirements for website navigation and user interface design.  ",
      "Analysed the management information and ROI measures that evaluated the success of the website."
    ]
  },
  {
    "company": "BUPA",
    "position": "User Interface designer",
    "website": "",
    "startDate": "1996",
    "endDate": "1998",
    "summary": "Business requirements, workflow and process diagrams and documentation.  Wireframe storyboards.  Research and software evaluations.",
    "link": "bupa",
    "highlights": [
      "Worked with business directors to produce business requirements and was in charge of creative development and user interface design of interactive web based healthcare products and stand alone touch screen applications.   ",
      "Liaised with the Head of Brand Development to reinterpret and redesign the BUPA brand from traditional advertising channels to first generation interactive services on the internet.   ",
      "Designed the user interface for BUPA Touchpoint screens for providing the general public with entertainment and information about BUPA's services.  ",
      "Responsible for the usability and functional requirements and managed a relationship with a third party partner (Current Science Group) in order to build the first version of www.consultantnet.org which is a specialised website for BUPA's medical consultants.  The site included electronic billing, news, email and discussion forums."
    ]
  },
  {
    "company": "Web Design",
    "position": "Designer",
    "website": "",
    "startDate": "1995",
    "endDate": "1996",
    "summary": "Business and technical requirements.  Use case scenarios and wire frame storyboards.",
    "link": "webdesign",
    "highlights": [
      "Created an online presence for a publishing agent to present book covers and excerpts from books.   ",
      "The site was launched to include reviews and upcoming book launches.  Produced a modular user interface for intranet patent databases for Derwent information Ltd.   ",
      "The system emphasised signposting and categorisation to enable novice users to navigate the patent literature."
    ]
  },
  {
    "company": "Design Consultant",
    "position": "Designer",
    "website": "",
    "startDate": "1992",
    "endDate": "1995",
    "summary": "Functional requirements, business and project plans.",
    "link": "design",
    "highlights": [
      "Designed and organised the production of custom wall to wall carpets and wall hangings for corporate and private clients.    ",
      "Clients included the Daily Mail, Friends Provident and Colonial Mutual.  ",
      "Managed the entire workflow from initial concept to the delivery of the final product which had been hand constructed by Vsoske Joyce in Ireland."
    ]
  }
],
  "volunteer": [
    {
    "organization": "",
    "position": "",
    "website": "",
    "startDate": "",
    "endDate": "",
    "summary": "",
    "highlights": [
      ""
    ]
  }
],
  "education": [
    {
    "institution": {
        "name": "UCL Institute of Education",
        "logo": "https://www.ucl.ac.uk/visual-identity/logos/standalone.png",
        "url": "https://www.ucl.ac.uk/ioe/courses/teacher-training/computing-ict-pgce"
      },
    "area": "Computer Science Teacher Training",
    "studyType": "PGCE with QTS",
    "startDate": "September 2013",
    "endDate": "July 2014",
    "gpa": "",
    "link": "ucl",
    "description": {
        "text": "Awarded a teacher training scholarship by the British Computer Society as part of a government initiative to promote computer science in schools.",
        "courses": [
          "Effective teaching of computing as a school subject",
          "Assessment and Learning",
          "Professional Practice and feedback",
          "Planning and Enabling Learning and Assessment",
          "Theories and Principles of Teaching and Learning",
          "Curriculum Design: Principles and Practice"
        ]
      }
  },
{
    "institution": {
        "name": "London School of Economics",
        "logo": "http://takeielts.britishcouncil.org/sites/default/files/London-School-of-Economics-and-Political-Science-Logo.png?1425825812",
        "url": "http://www.lse.ac.uk/"
      },
    "area": "Analysis, Design and Management of Information Systems",
    "studyType": "MSc. Information Systems",
    "startDate": "September 1996",
    "endDate": "July 1997",
    "gpa": "",
    "link": "lse",
    "description": {
        "text": "The MSc was undertaken at the same time as working for BUPA.",
        "courses": [
          "Information Systems in Organisations",
          "Systems Development using Soft Systems Methodology and UML",
          "Information Systems Management in Context",
          "Innovation and Technology Management",
          "Information, Risk and Security",
          "IT and Development",
          "Management and Economics of E-Business",
          "Designing Information Systems",
          "Information Society: theory and practice",
          "Information systems: privacy and data protection",
          "Completed dissertation on project management issues in the Automotive Industry"
        ]
      }
  },
{
    "institution": {
        "name": "Birkbeck College, University of London",
        "logo": "https://upload.wikimedia.org/wikipedia/en/thumb/1/13/Birkbeck%2C_University_of_London_logo.svg/311px-Birkbeck%2C_University_of_London_logo.svg.png",
        "url": "http://www.bbk.ac.uk/psychology/"
      },
    "area": "Cognitive Psychology",
    "studyType": "BSc. Psychology",
    "startDate": "September 1990",
    "endDate": "July 1994",
    "gpa": "",
    "link": "birkbeck",
    "description": {
        "text": "The BSc. was undertaken while working as a designer.",
        "courses": [
          "Social Psychology",
          "Personality and Individual Differences",
          "Reasoning and Decision Making",
          "Perception and Attention",
          "Animal Learning",
          "Abnormal Psychology and Neuroscience",
          "Memory and Cognition",
          "Child Development",
          "Language",
          "Critical Analysis and Experimental Research",
          "Published paper: M.J. Gosschalk and Dr. V.H. Gregg, 'Cognitive Processes During Memory Retrieval'."
        ]
      }
  },
  {
    "institution": {
        "name": "Konstfack School of Art and Design",
        "logo": "https://www.konstfack.se/Global/extern/konstfack_logotyp_stor.jpg",
        "url": "https://www.konstfack.se/en/"
      },
    "area": "Art and Design",
    "studyType": "BA Textile Design",
    "startDate": "September 1980",
    "endDate": "June 1984",
    "gpa": "",
    "link": "konstfack",
    "description": {
        "text": "A 4 year Ba in Textile Design which included work experience in a Textile Printing Factory in Boras, Sweden and working in a Design Studio in Lyon, France",
        "courses": [
          "Colour Theory",
          "Design Theory",
          "Product Design",
          "Life Drawing",
          "Perspective Drawing",
          "Mixed Media Painting",
          "Screen Printing",
          "Photography",
          "Weaving",
          "Art History",
          "Work Experience in a Printing Factory in Southern Sweden",
          "Work Experience in a Design Studio in Lyon, France",
          "Sold Final Year Artwork to a hospital in Stockholm, Sweden"
        ]
      }
  }
],
  "awards": [{
    "title": "",
    "date": "",
    "awarder": "",
    "summary": ""
  }],
  "publications": [{
    "name": "",
    "publisher": "",
    "releaseDate": "",
    "website": "",
    "summary": ""
  }],
  "skills": [
    {
    "name": "Web Development",
    "type": "js",
    "level": "",
    "description": "Develop web applications using HTML, CSS, Angular with Typescript with JSON data formats. Use Github for version control and Heroku and Firebase for production.",
    "keywords": [
      { "name": "HTML", "level": 80},
      { "name": "Bootstrap", "level": 70},
      { "name": "CSS", "level": 70},
      { "name": "Angular", "level": 70},
      { "name" : "React", "level": 50},
      { "name" : "Redux", "level" : 50},
      { "name" : "Rails", "level" : 40},
      { "name": "Javascript", "level": 50},
      { "name": "TypeScript", "level": 50},
      { "name": "json", "level": 50}
    ]
  },
  {
    "name": "UX Design",
    "type": "ux",
    "level": "",
    "description": "Define online product design with user scenarios, personas, wire frame story boards to illustrate the functionality of the user interface design.",
    "keywords": [
         { "name": "Persona design", "level": 70 },
         { "name": "Interaction design", "level": 70 },
         { "name": "User testing", "level": 60}
      ]
  },
  {
    "name": "UX Prototyping",
    "type": "prototype",
    "level": "",
    "description": "Create low fidelity, medium fidelity wireframes in Axure and high fidelity prototyes in Angular.",
    "keywords": [
      { "name": "Axure", "level": 60},
      { "name": "Justinmind", "level": 50},
      { "name": "Paper prototyping", "level": 70}
    ]
  },
  {
    "name": "Business Analysis",
    "type": "ba",
    "level": "",
    "description": "Business requirements and functionality specifications using Axure to combine user interface with business requirements.  Entity relationship diagrams, process flows and use cases for different user and customer groups.",
    "keywords": [
      { "name": "Process Flow diagrams", "level": 60},
      { "name": "Entity Relationship diagrams", "level": 60 },
      { "name": "Stakeholder management", "level": 60},
      { "name": "Project management", "level": 70}
    ]
  }
],
  "languages": [
    {
    "name": "English",
    "level": "Native speaker"
    },
    {
    "name": "Swedish",
    "level": "Advanced"
    }
],
  "interests": [
    {
    "name": "JavaScript Frameworks",
    "keywords": [
      "Angular",
      "React",
      "VueJS"
    ]
    },
    {
    "name": "Business skills",
    "keywords": [
      "Design Thinking",
      "Innovation"
    ]
    }
],
  "references": [{
    "name": "",
    "reference": ""
  }]
}
